# Найти сумму чисел списка стоящих на нечетной позиции.

my_list = [2, 3, 4, 5, 6, 7, 8, 9, ]
print(sum(my_list[1::2]))
